# -*- coding: utf-8 -*-
"""
Created on Wed Sep  2 21:18:26 2015

@author: deokwooj
"""

"""
* Description 
- This file defines global constant symbols and definitions used through in this program. 
- Should be included all python modules first. 
"""
import na_tools as nt
# Define media code dictionary
#(media name, media id)
media_code={\
'강원도민일보':1300101,\
'강원일보':1300201,\
'경기일보':1200101,\
'경남도민일보':1500151,\
'경남신문':1500051,\
'경상일보':1500301,\
'경인일보':1200201,\
'경향신문':1100101,\
'광주일보':1600301,\
'국민일보':1100201,\
'국제신문':1500401,\
'기자협회보':7100702,\
'김포뉴스':5200752,\
'내일신문':1100301,\
'당진시대':5520352,\
'대덕넷':4400108,\
'대전일보':1400201,\
'매일신문':1500601,\
'무등일보':1600501,\
'미디어오늘':7100251,\
'문화일보':1100501,\
'부산일보':01500701,\
'브레이크뉴스':4100608,\
'새전북신문':1600601,\
'서울신문':1100601,\
'세계일보':1100701,\
'한국경제':2100601,\
'한국재경신문':4101358,\
'시사인':6100252,\
'MBC':8100201,\
'KNN':8520101,\
'머니투데이':2100201,\
'오마이뉴스':4100908,\
'헤럴드경제':2100701,\
'스포츠서울':10100101,\
'스포츠칸':10100201,\
'영남일보':1500801,\
'옥천신문':5410052,\
'이데일리':4101008,\
'인천일보':1200401,\
'전남일보':1600801,\
'전북도민일보':1601001,\
'전북일보':1601101,\
'제민일보':1700101,\
'중도일보':1400351,\
'중부매일':1400401,\
'충북일보':1400551,\
'충청투데이':1400701,\
'파이낸셜뉴스':2100501,\
'평택문화신문':5202702,\
'한겨레':1101001,\
'한라일보':1700201,\
'홍성신문':5420702,\
'PD저널':7100602,\
'아시아투데이':1100751,\
'한국일보':1101101,\
'매일경제':2100101,\
'서울경제':2100301,\
'이투데이':2100351,\
'프라임경제':2100563,\
'투데이코리아':4101258,\
'국방일보':4103008,\
'KBS':8100101,\
'SBS':8100301,\
'동아일보':1100401,\
'노컷뉴스':4100058,\
'조세일보':4101208,\
'코리아헤럴드':3100101\
}


# Define informer code dictionary
#(organization name, organization id)
informer_code={\
'법원':111,\
'검찰':211,\
'변호사':311,\
'경찰소방':411,\
'정당':121,\
'국회':221,\
'청와대':131,\
'행정부':231,\
'지자체':331,\
'정부출연':431,\
'정치인':141,\
'북한':241,\
'군대':341,\
'국제기구':441,\
'농림수산':112,\
'광업':212,\
'에너지':312,\
'IT전자':122,\
'차선박항공':222,\
'건설업':322,\
'중소기업':422,\
'석유화학':522,\
'제약':722,\
'제철':622,\
'패션식품마트':132,\
'금융':232,\
'서비스업':332,\
'병원':532,\
'자영업':432,\
'관광외식':532,\
'운송':632,\
'협회':142,\
'노조':152,\
'직장인':252,\
'교육기관':113,\
'과학기술계':213,\
'인문사회계':313,\
'학원':513,\
'의료계':413,\
'카톨릭계기독교계':123,\
'불교계':223,\
'유림천도교원불교':323,\
'통일교이슬람교기타':423,\
'미술계':133,\
'문학':233,\
'음악계':333,\
'문화재':433,\
'연극계공연계행위예술':633,\
'예술계기타':533,\
'언론계':143,\
'연예계':243,\
'평론가':343,\
'광고계':443,\
'프로스포츠':153,\
'스포츠용품':353,\
'아마추어스포츠':253,\
'정치관련':114,\
'경제관련':214,\
'문화친목':314,\
'봉사자선환경':414,\
'주민자치기타':514,\
'버스':144,\
'지하철철도':244,\
'택시':344,\
'대중교통기타':544,\
'여객선':444,\
'일반인네티즌':124,\
'소비자':224,\
'범죄자':324,\
'북미유럽정치':115,\
'북미유럽경제':215,\
'북미유럽사회문화기타':315,\
'동아시아오세아니아정치':125\
'동아시아오세아니아경제':225,\
'동아시아오세아니아사회문화기타':325,\
'중동아프리카정치':135,\
'중동아프리카경제':235,\
'중동아프리카사회문화기타':335,\
'남미정치':145,\
'남미경제':245,\
'남미사회문화기타':345\
}

#noun_dict={1:'대한민국', 2:'분단','3:북한',....so on}
noun_dict_temp_1=nt.loadObjectBinaryFast(DICT_SPLIT_ARR_NOUNS)
noun_dict_temp_2=nt.loadObjectBinaryFast(DICT_NOUNS)

all_nouns=[]
for key in noun_dict_temp.iteritems():
    print key[0]
    print '---------------'
    for wd in key[1]:
        all_nouns.append(wd)
noun_dict={}
for i,noun in enumerate(set(all_nouns)):
    noun_dict.update({i:noun})

# 
#for key, noun in noun_dict.iteritems():
#    print key, noun
